Merge pull request #14 from HoangDinhBui/feature/cloud-integration
Feature/cloud integration
